name='Aleksey'                          # Создайте переменную name и присвойте ей значение вашего имени (строка).
print('Name'+':',name)                  #Выведите значение переменной name на экран.
age=38                                  #Создайте переменную age и присвойте ей значение вашего возраста (целое число).
print('Age'+':',age)                    #Выведите значение переменной age на экран.
age=age+5                              #Перезапишите в age текущее значение переменной age + новое.
print('New_Age'+':',age)                #Выведите измененное значение переменной age на экран.
is_student=True                         #Создайте переменную is_student и присвойте ей значение True (логическое значение)
print('Is_Student'+':',is_student)      #Выведите значение переменной is_student на экран.